tap "d12frosted/emacs-plus"
tap "elastic/tap"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "mutagen-io/mutagen"
tap "nikitabobko/tap"
tap "saulpw/vd"
tap "thezoraiz/ascii-image-converter"
brew "cryptography"
brew "libssh"
brew "python@3.12"
brew "ansible"
brew "zstd"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "argus"
brew "austin"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bash"
brew "bat"
brew "bottom"
brew "btop"
brew "gettext"
brew "glib"
brew "cairo"
brew "llvm"
brew "ccls"
brew "cheat"
brew "chezmoi"
brew "clipboard"
brew "cmake"
brew "commitizen"
brew "cookiecutter"
brew "docutils"
brew "duckdb"
brew "libtool"
brew "wxwidgets"
brew "erlang"
brew "exa"
brew "fd"
brew "libidn2"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "libass"
brew "libmicrohttpd"
brew "pango"
brew "tesseract"
brew "zeromq"
brew "ffmpeg"
brew "figlet"
brew "flamegraph"
brew "fzf"
brew "gcc"
brew "libavif"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "ghostscript"
brew "git-delta"
brew "git-filter-repo"
brew "node"
brew "gitlab-ci-local"
brew "gitleaks"
brew "gnu-sed"
brew "gnupg"
brew "pkgconf"
brew "gobject-introspection"
brew "gpatch"
brew "gpgme"
brew "grafana"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "guile"
brew "hadolint"
brew "helix"
brew "htop"
brew "iftop"
brew "shared-mime-info"
brew "libheif"
brew "liblqr"
brew "libraw"
brew "imagemagick"
brew "iperf3"
brew "jq"
brew "json-c"
brew "zookeeper"
brew "kafka"
brew "librdkafka"
brew "kcat"
brew "perl"
brew "latexindent"
brew "lazygit"
brew "lesspipe"
brew "libgccjit"
brew "libgit2"
brew "libplacebo"
brew "lnav"
brew "lolcat"
brew "lsd"
brew "lua-language-server"
brew "markdownlint-cli"
brew "miller"
brew "mise"
brew "mosh"
brew "vapoursynth"
brew "yt-dlp"
brew "mpv"
brew "mtr"
brew "multimarkdown"
brew "mypy"
brew "navi"
brew "ncdu"
brew "tree-sitter"
brew "neovim"
brew "nuttcp"
brew "nvm"
brew "ollama"
brew "openjdk@11"
brew "opensc"
brew "pandoc"
brew "pdm"
brew "poetry"
brew "poppler"
brew "postgresql@14"
brew "procs"
brew "pv"
brew "pyflow"
brew "pygments"
brew "pyright"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "qt"
brew "rabbitmq"
brew "ranger"
brew "ruby-build"
brew "rbenv"
brew "rbenv-gemset"
brew "rbenv-vars"
brew "reattach-to-user-namespace"
brew "redis"
brew "rich-cli"
brew "ripgrep"
brew "ruff"
brew "ruff-lsp"
brew "rust"
brew "shellcheck"
brew "smimesign"
brew "sonar-scanner"
brew "speedtest-cli"
brew "sshuttle"
brew "starship"
brew "stow"
brew "telnet"
brew "texlive"
brew "the_silver_searcher"
brew "tidy-viewer"
brew "tig"
brew "tldr"
brew "tmux"
brew "transmission-cli"
brew "tree"
brew "unoconv"
brew "virtualenv"
brew "wget"
brew "wireshark"
brew "xclip"
brew "xmrig"
brew "xsel"
brew "xsv"
brew "zellij"
brew "zenith"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-modern-yellow-icon"]
brew "felixkratz/formulae/borders"
brew "mutagen-io/mutagen/mutagen"
brew "saulpw/vd/visidata"
brew "thezoraiz/ascii-image-converter/ascii-image-converter"
cask "adobe-acrobat-reader"
cask "aerospace"
cask "amethyst"
cask "appcleaner"
cask "brewlet"
cask "clickhouse"
cask "docker"
cask "ferdium"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "font-juliamono"
cask "google-chrome"
cask "iterm2"
cask "itsycal"
cask "karabiner-elements"
cask "keepassxc"
cask "keeweb"
cask "kitty"
cask "lapce"
cask "launchbar"
cask "lunar"
cask "macfuse"
cask "mattermost"
cask "omnissa-horizon-client"
cask "plex"
cask "qlvideo"
cask "qutebrowser"
cask "rar"
cask "raycast"
cask "shortcat"
cask "skype"
cask "slack"
cask "sloth"
cask "sol"
cask "spotify"
cask "stats"
cask "stolendata-mpv"
cask "sweet-home3d"
cask "tigervnc-viewer"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "wezterm@nightly"
cask "whichspace"
cask "zed"
cask "zoom"
vscode "aaronthomas.vscode-snazzy-operator"
vscode "adamcaviness.theme-monokai-dark-soda"
vscode "adpyke.vscode-sql-formatter"
vscode "aeppert.bro"
vscode "alefragnani.project-manager"
vscode "alexcvzz.vscode-sqlite"
vscode "asvetliakov.vscode-neovim"
vscode "atomiks.moonlight"
vscode "bceskavich.theme-dracula-at-night"
vscode "bodil.file-browser"
vscode "buenon.scratchpads"
vscode "cameron.vscode-pytest"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "cstrap.python-snippets"
vscode "dansarich.tokyo-right"
vscode "davidanson.vscode-markdownlint"
vscode "dev1ce.dev1ce"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "eliverlara.andromeda"
vscode "emilast.logfilehighlighter"
vscode "fayras.simple-new-file"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "goessner.mdmath"
vscode "googlecloudtools.cloudcode"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "humao.rest-client"
vscode "isaaccodes.electronic-moonlight-theme"
vscode "jacobdufault.fuzzy-search"
vscode "jairhenrique.pytest-snippets"
vscode "james-yu.latex-workshop"
vscode "jprestidge.theme-material-theme"
vscode "julialang.language-julia"
vscode "kahole.magit"
vscode "karigari.chat"
vscode "kevinrose.vsc-python-indent"
vscode "lextudio.restructuredtext"
vscode "lucassonego.dracula-text-only"
vscode "maplefactory.tiller"
vscode "mattn.lisp"
vscode "mblode.zotero"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "mtxr.sqltools"
vscode "njpwerner.autodocstring"
vscode "nonylene.dark-molokai-theme"
vscode "ntbbloodbath.doom-one"
vscode "oderwat.indent-rainbow"
vscode "p403n1x87.austin-vscode"
vscode "proxzima.sweetdracula"
vscode "qufiwefefwoyn.kanagawa"
vscode "randomfractalsinc.vscode-data-preview"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "rlivings39.fzf-quick-open"
vscode "rokoroku.vscode-theme-darcula"
vscode "ryanluker.vscode-coverage-gutters"
vscode "singularitti.vscode-julia-formatter"
vscode "swyddfa.esbonio"
vscode "tamasfe.even-better-toml"
vscode "tcwalther.cython"
vscode "timonwong.shellcheck"
vscode "tinaciousdesign.theme-tinaciousdesign"
vscode "tomoki1207.pdf"
vscode "trond-snekvik.simple-rst"
vscode "turiiya.german-scroll"
vscode "ultram4rine.sqltools-clickhouse-driver"
vscode "vscode-icons-team.vscode-icons"
vscode "vscode-org-mode.org-mode"
vscode "vscodevim.vim"
vscode "vspacecode.vspacecode"
vscode "vspacecode.whichkey"
vscode "wayou.vscode-todo-highlight"
vscode "xadillax.viml"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
