tap "d12frosted/emacs-plus"
tap "elastic/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "mutagen-io/mutagen"
tap "thezoraiz/ascii-image-converter"
brew "ansible"
brew "zstd"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "argus"
brew "automake"
brew "asdf"
brew "docutils"
brew "awscli"
brew "bash"
brew "bat"
brew "gcc"
brew "btop"
brew "glib"
brew "pkg-config"
brew "cairo"
brew "ccls"
brew "cheat"
brew "clipboard"
brew "cmake"
brew "commitizen"
brew "cookiecutter"
brew "duckdb"
brew "wxwidgets"
brew "erlang"
brew "exa"
brew "fd"
brew "figlet"
brew "fzf"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "ghostscript"
brew "git-delta"
brew "git-filter-repo"
brew "node"
brew "gitlab-ci-local"
brew "libidn2"
brew "unbound"
brew "gnutls"
brew "gobject-introspection"
brew "guile"
brew "hadolint"
brew "harfbuzz"
brew "helix"
brew "htop"
brew "iftop"
brew "shared-mime-info"
brew "libheif"
brew "python@3.9"
brew "libraw"
brew "imagemagick"
brew "jq"
brew "openjdk"
brew "zookeeper"
brew "kafka"
brew "librdkafka"
brew "kcat"
brew "perl"
brew "latexindent"
brew "lazygit"
brew "lesspipe"
brew "libgccjit"
brew "libmicrohttpd"
brew "pango"
brew "librsvg"
brew "libssh"
brew "lolcat"
brew "lsd"
brew "lua-language-server"
brew "markdownlint-cli"
brew "miller"
brew "mosh"
brew "mtr"
brew "multimarkdown"
brew "mypy"
brew "navi"
brew "ncdu"
brew "tree-sitter"
brew "neovim", args: ["HEAD"]
brew "neovide"
brew "neovim-remote"
brew "nvm"
brew "openjdk@11"
brew "opensc"
brew "pandoc"
brew "pygments"
brew "virtualenv"
brew "pdm"
brew "poetry"
brew "poppler"
brew "postgresql@14"
brew "pv"
brew "pyflow"
brew "pyright"
brew "python@3.10"
brew "qt"
brew "rabbitmq"
brew "ranger"
brew "ruby-build"
brew "rbenv"
brew "rbenv-gemset"
brew "rbenv-vars"
brew "reattach-to-user-namespace"
brew "redis"
brew "rich-cli"
brew "ripgrep"
brew "rtx"
brew "rust"
brew "shellcheck"
brew "smimesign"
brew "sonar-scanner"
brew "spaceship"
brew "starship"
brew "stow"
brew "telnet"
brew "texlive"
brew "the_silver_searcher"
brew "tidy-viewer"
brew "tig"
brew "tldr"
brew "tmux"
brew "transmission-cli"
brew "tree"
brew "unoconv"
brew "wget"
brew "wireshark"
brew "xclip"
brew "xmrig"
brew "xsel"
brew "xsv"
brew "youtube-dl"
brew "zeek"
brew "zellij"
brew "zeromq"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-dbus", "with-modern-yellow-icon", "with-native-comp", "with-no-titlebar"]
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "mutagen-io/mutagen/mutagen"
brew "thezoraiz/ascii-image-converter/ascii-image-converter"
cask "adobe-acrobat-reader"
cask "appcleaner"
cask "brewlet"
cask "clickhouse"
cask "docker"
cask "ferdi"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "font-juliamono"
cask "google-chrome"
cask "iterm2"
cask "itsycal"
cask "karabiner-elements"
cask "keepassxc"
cask "keeweb"
cask "lapce"
cask "launchbar"
cask "lunar"
cask "macfuse"
cask "mattermost"
cask "mpv"
cask "plex"
cask "qlvideo"
cask "qutebrowser"
cask "rar"
cask "raycast"
cask "shortcat"
cask "skype"
cask "slack"
cask "sloth"
cask "sol"
cask "spotify"
cask "stats"
cask "sweet-home3d"
cask "tigervnc-viewer"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "vmware-horizon-client"
cask "wezterm"
cask "whichspace"
cask "zoom"
vscode "adpyke.vscode-sql-formatter"
vscode "aeppert.bro"
vscode "alefragnani.project-manager"
vscode "alexcvzz.vscode-sqlite"
vscode "asvetliakov.vscode-neovim"
vscode "atomiks.moonlight"
vscode "bceskavich.theme-dracula-at-night"
vscode "bodil.file-browser"
vscode "buenon.scratchpads"
vscode "Cameron.vscode-pytest"
vscode "Catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "DanSarich.tokyo-right"
vscode "DavidAnson.vscode-markdownlint"
vscode "dev1ce.dev1ce"
vscode "donjayamanne.githistory"
vscode "DotJoshJohnson.xml"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "emilast.LogFileHighlighter"
vscode "fayras.simple-new-file"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.vscode-pull-request-github"
vscode "GitLab.gitlab-workflow"
vscode "goessner.mdmath"
vscode "GrapeCity.gc-excelviewer"
vscode "Gruntfuggly.todo-tree"
vscode "humao.rest-client"
vscode "isaaccodes.electronic-moonlight-theme"
vscode "jacobdufault.fuzzy-search"
vscode "jairhenrique.pytest-snippets"
vscode "James-Yu.latex-workshop"
vscode "jprestidge.theme-material-theme"
vscode "julialang.language-julia"
vscode "kahole.magit"
vscode "karigari.chat"
vscode "KevinRose.vsc-python-indent"
vscode "lextudio.restructuredtext"
vscode "LucasSonego.dracula-text-only"
vscode "maplefactory.tiller"
vscode "mattn.Lisp"
vscode "mblode.zotero"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "mtxr.sqltools"
vscode "njpwerner.autodocstring"
vscode "nonylene.dark-molokai-theme"
vscode "NTBBloodbath.doom-one"
vscode "oderwat.indent-rainbow"
vscode "p403n1x87.austin-vscode"
vscode "RandomFractalsInc.vscode-data-preview"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "rlivings39.fzf-quick-open"
vscode "ryanluker.vscode-coverage-gutters"
vscode "singularitti.vscode-julia-formatter"
vscode "SonarSource.sonarlint-vscode"
vscode "tamasfe.even-better-toml"
vscode "tcwalther.cython"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "tootone.org-mode"
vscode "trond-snekvik.simple-rst"
vscode "Turiiya.german-scroll"
vscode "ultram4rine.sqltools-clickhouse-driver"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "VSpaceCode.vspacecode"
vscode "VSpaceCode.whichkey"
vscode "wayou.vscode-todo-highlight"
vscode "XadillaX.viml"
vscode "yzhang.markdown-all-in-one"
vscode "ZainChen.json"
